{
  "format": "layers-model",
  "generatedBy": "keras v2.15.0",
  "convertedBy": "TensorFlow.js Converter",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential",
      "layers": [
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d",
            "trainable": true,
            "batch_input_shape": [
              null,
              28,
              28,
              1
            ],
            "dtype": "float32",
            "filters": 16,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            }
          }
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
              2,
              2
            ],
            "padding": "valid",
            "strides": [
              2,
              2
            ],
            "data_format": "channels_last"
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_1",
            "trainable": true,
            "dtype": "float32",
            "filters": 32,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            }
          }
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d_1",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
              2,
              2
            ],
            "padding": "valid",
            "strides": [
              2,
              2
            ],
            "data_format": "channels_last"
          }
        },
        {
          "class_name": "Flatten",
          "config": {
            "name": "flatten",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last"
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.3
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense",
            "trainable": true,
            "dtype": "float32",
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            }
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_1",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.3
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "dtype": "float32",
            "units": 10,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            }
          }
        }
      ]
    },
    "keras_version": "2.15.0",
    "backend": "tensorflow"
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "conv2d/kernel",
          "shape": [
            3,
            3,
            1,
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d/bias",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_1/kernel",
          "shape": [
            3,
            3,
            16,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_1/bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/kernel",
          "shape": [
            1568,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [
            64,
            10
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [
            10
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}